<template>
  <div class="social-networks">
<!--    <div class="social-networks__card">-->
<!--      <h1 class="social-networks__title">-->
<!--        Хочешь трудоустроится в IT компанию?-->
<!--      </h1>-->
<!--      <h2 class="social-networks__subtitle">-->
<!--        Подпишись на наш телеграм канал с актуальными вакансиями!-->
<!--      </h2>-->
<!--      <a-->
<!--        href=""-->
<!--        class="social-networks__link telegram"-->
<!--        target="_blank"-->
<!--      >-->
<!--        <svg width="16" height="13" viewBox="0 0 15 12" fill="none" xmlns="http://www.w3.org/2000/svg">-->
<!--          <path fill-rule="evenodd" clip-rule="evenodd"-->
<!--                d="M7.0752 5.80908C7.18153 5.73796 7.288 5.66674 7.39483 5.59552C7.46008 5.54916 7.52532 5.50264 7.59057 5.45611C7.85153 5.27 8.11249 5.08389 8.37346 4.90877C8.53806 4.79405 8.70157 4.67787 8.86505 4.56173C9.26429 4.27809 9.66332 3.99459 10.0775 3.7327C10.2234 3.64256 10.3736 3.55243 10.5367 3.50092L10.5405 3.49966C10.604 3.47848 10.6752 3.45471 10.7299 3.50521C10.7834 3.55493 10.7654 3.61827 10.7487 3.67703C10.7467 3.68422 10.7446 3.69134 10.7428 3.69836C10.7256 3.76704 10.6955 3.82713 10.644 3.88293C10.0274 4.54816 9.35542 5.15808 8.68197 5.76934C8.58197 5.86011 8.48193 5.9509 8.38204 6.04191L8.35629 6.05479C8.2263 6.17657 8.09719 6.29791 7.96839 6.41895C7.69315 6.67762 7.41936 6.93492 7.14159 7.19223C6.92269 7.39396 6.74242 7.62145 6.65228 7.91332C6.57073 8.18373 6.6394 8.50994 6.92269 8.6945C7.12409 8.82435 7.32058 8.96238 7.51721 9.10051C7.63906 9.18611 7.76098 9.27175 7.88415 9.3555C8.23899 9.59588 8.59431 9.83578 8.94963 10.0757C9.66021 10.5554 10.3708 11.0352 11.0776 11.5188C11.6913 11.9394 12.5498 11.6046 12.6957 10.8792C12.7283 10.7292 12.7535 10.5767 12.7788 10.4236C12.7868 10.3752 12.7948 10.3268 12.803 10.2783C12.8867 9.78902 12.9694 9.30078 13.052 8.81254C13.1346 8.3243 13.2172 7.83606 13.3009 7.34675C13.331 7.1751 13.3599 7.00453 13.3889 6.83395C13.4179 6.66329 13.4469 6.49264 13.4769 6.32091C13.4791 6.30588 13.4801 6.28979 13.4812 6.27369C13.4823 6.2576 13.4833 6.2415 13.4855 6.22648C13.4923 6.1844 13.4992 6.14239 13.506 6.10043C13.5549 5.79994 13.6034 5.50194 13.6486 5.20064C13.7602 4.46667 13.8675 3.73699 13.9748 3.00732C14.0349 2.61243 14.0864 2.21755 14.1207 1.82266C14.1379 1.64239 14.1508 1.45782 14.1637 1.27326C14.1765 1.08869 14.1164 0.938466 13.9834 0.818284C13.8203 0.672348 13.6143 0.659472 13.4082 0.668056C13.155 0.680933 12.906 0.736732 12.6657 0.826869C12.1292 1.03289 11.5969 1.23892 11.0647 1.44924C9.64825 2.01581 8.23611 2.58668 6.83255 3.17471C6.24452 3.41937 5.66078 3.66402 5.07704 3.91297C4.83382 4.01598 4.59061 4.1228 4.34739 4.22963C4.22577 4.28305 4.10414 4.33647 3.98252 4.38941C3.85315 4.44676 3.72378 4.50328 3.59454 4.55974C3.30785 4.68499 3.02179 4.80997 2.73778 4.94311C2.22271 5.17918 1.70764 5.42383 1.20975 5.69854C1.2053 5.70103 1.20084 5.70352 1.19637 5.70602C1.09323 5.76368 0.987461 5.82281 0.909291 5.91744C0.806278 6.03762 0.806278 6.14493 0.909291 6.26511C0.973675 6.33808 1.05523 6.39817 1.14107 6.44109C1.98664 6.86173 2.86654 7.18364 3.80225 7.32529C4.2701 7.39825 4.7122 7.30812 5.12425 7.05488C5.27461 6.96027 5.42697 6.86765 5.57948 6.77494C5.81446 6.63211 6.04981 6.48904 6.27886 6.33808C6.54545 6.16341 6.80986 5.98656 7.0752 5.80908Z"-->
<!--                fill="#0088CC"/>-->
<!--        </svg>-->
<!--        Подписаться-->
<!--      </a>-->
<!--    </div>-->
    <div class="social-networks__card">
      <h1 class="social-networks__title">
        Мы в Instagram!
      </h1>
      <h2 class="social-networks__subtitle">
        Успешные группы, лайв эфиры, полезные статьи все это на нашем Instagram аккаунте
      </h2>
      <div class="social-networks__gradient-bg">
        <a
          href="https://www.instagram.com/bitlabacademy"
          class="social-networks__link instagram"
          target="_blank"
        >
          <svg width="16" height="15" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M11.4887 1.01149C12.1928 1.71304 12.4123 2.56454 12.4578 3.52583C12.5141 4.51657 12.5141 7.48343 12.4578 8.47417C12.4096 9.43546 12.1901 10.287 11.4887 10.9885C10.7873 11.6927 9.93603 11.9123 8.97496 11.9578C7.98444 12.0141 5.01556 12.0141 4.02504 11.9578C3.06397 11.9096 2.21534 11.6901 1.51127 10.9885C0.807195 10.287 0.587674 9.43546 0.542164 8.47417C0.485945 7.48343 0.485945 4.51389 0.542164 3.52315C0.590351 2.56187 0.807195 1.71036 1.51127 1.00881C2.21534 0.307263 3.06665 0.0876939 4.02504 0.0421734C5.01556 -0.0140578 7.98444 -0.0140578 8.97496 0.0421734C9.93603 0.0903715 10.7873 0.309941 11.4887 1.01149ZM6.49993 4.28565C5.55315 4.28565 4.78564 5.05316 4.78564 5.99994C4.78564 6.94671 5.55315 7.71422 6.49993 7.71422C7.4467 7.71422 8.21421 6.94671 8.21421 5.99994C8.21421 5.05316 7.4467 4.28565 6.49993 4.28565ZM3.07136 5.99994C3.07136 4.10639 4.60638 2.57137 6.49993 2.57137C8.39348 2.57137 9.9285 4.10639 9.9285 5.99994C9.9285 7.89349 8.39348 9.42851 6.49993 9.42851C4.60638 9.42851 3.07136 7.89349 3.07136 5.99994ZM9.92847 3.42886C10.4019 3.42886 10.7856 3.0451 10.7856 2.57171C10.7856 2.09833 10.4019 1.71457 9.92847 1.71457C9.45508 1.71457 9.07133 2.09833 9.07133 2.57171C9.07133 3.0451 9.45508 3.42886 9.92847 3.42886Z" fill="url(#paint0_radial)"/>
            <defs>
              <radialGradient id="paint0_radial" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(3.68752 12.9243) rotate(-90) scale(11.8929)">
                <stop stop-color="#FFDD55"/>
                <stop offset="0.1" stop-color="#FFDD55"/>
                <stop offset="0.5" stop-color="#FF543E"/>
                <stop offset="1" stop-color="#C837AB"/>
              </radialGradient>
            </defs>
          </svg>
          Подписаться
        </a>
      </div>
    </div>
  </div>
</template>

<script>

export default {
  name: "SocialNetworks",
}
</script>

<style lang="scss">
.social-networks {
  display: flex;
  flex-direction: column;
  height: 100%;
  max-height: 500px;
  overflow: auto;

  &::-webkit-scrollbar {
    width: 0;
  }

  &::-webkit-scrollbar-track {
    background: rgba(23, 23, 41, 0.08);
    border-radius: 100px;
  }

  &::-webkit-scrollbar-thumb {
    background: #9FA4B1;
    border-radius: 100px;
  }

  &::-webkit-scrollbar-thumb:hover {
    background: #555;
  }

  .social-networks__card {
    border: 1px solid rgba(23, 23, 41, 0.08);
    box-sizing: border-box;
    border-radius: 10px;
    margin: 0 24px 24px 24px;
    background-color: #FFFFFF;
    padding: 16px;
    display: flex;
    flex-direction: column;
    // justify-content: space-between;
    // height: 100%;
    gap: 16px;
  }

  .social-networks__title {
    font-size: 14px;
    font-weight: 700;
    line-height: 24px;
  }

  .social-networks__subtitle {
    font-weight: 400;
    font-size: 13px;
    line-height: 24px;
  }

  .social-networks__gradient-bg {
    width: 100%;
    height: 40px;
    border-radius: 4px;
    padding: 1px;
    background: radial-gradient(99.11% 99.11% at 26.56% 107.7%, #FFDD55 0%, #FFDD55 10%, #FF543E 50%, #C837AB 100%);
  }

  .social-networks__link {
    width: 100%;
    padding: 16px;
    border-radius: 4px;
    height: 40px;
    text-decoration: none;
    display: flex;
    align-items: center;
    justify-content: center;
    font-weight: 400;
    line-height: 16px;
    transition: all .4s ease;

    svg {
      margin-right: 5px;
    }

    &.telegram {
      border: 1px solid #0088CC;
      color: #0088CC;
    }

    &.instagram {
      color: #FF543E;
      background-color: #FFFFFF;
      height: 100%;
    }

    &:hover {
      &.telegram {
        background-color: #0088CC;
        color: #FFF;

        path {
          fill: white
        }
      }

      &.instagram {
        background-color: transparent;
        color: #FFFFFF;

        path {
          fill: white
        }
      }
    }
  }
}
</style>