<template>
  <div class="qr-tab justify-center justify-sm-start">
    <img ref="qrTarget" class="mx-auto mx-sm-0">
    <div class="d-flex flex-column" style="max-width: 320px">
      <a href="https://t.me/joinchat/vWBn3wnnV0oxYmQy" class="qr-tab__link" target="_blank">
        <div class="qr-tab__telegram-icon">
          <svg width="39" height="33" viewBox="0 0 39 33" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M18.2726 15.4112C18.5808 15.205 18.8895 14.9985 19.1993 14.792C19.3884 14.6576 19.5776 14.5227 19.7668 14.3878C20.5234 13.8482 21.28 13.3086 22.0366 12.8009C22.5138 12.4683 22.9879 12.1315 23.4619 11.7948C24.6193 10.9724 25.7762 10.1505 26.977 9.39118C27.4001 9.12985 27.8356 8.86851 28.3085 8.71918L28.3195 8.71552C28.5034 8.65413 28.7099 8.58522 28.8685 8.73163C29.0238 8.87576 28.9715 9.05941 28.9231 9.22976C28.9172 9.25061 28.9113 9.27127 28.9059 9.29162C28.8561 9.49073 28.769 9.66495 28.6196 9.82673C26.8318 11.7554 24.8836 13.5237 22.931 15.296C22.6411 15.5591 22.3511 15.8224 22.0615 16.0862L21.9868 16.1236C21.6099 16.4766 21.2356 16.8284 20.8622 17.1794C20.0642 17.9293 19.2704 18.6753 18.4651 19.4213C17.8304 20.0062 17.3077 20.6657 17.0464 21.512C16.81 22.296 17.0091 23.2417 17.8304 23.7768C18.4143 24.1533 18.984 24.5535 19.5541 24.954C19.9074 25.2021 20.2608 25.4504 20.6179 25.6933C21.6467 26.3902 22.6769 27.0857 23.7071 27.7813C25.7672 29.1722 27.8274 30.5632 29.8765 31.9652C31.6561 33.1848 34.1449 32.2141 34.568 30.111C34.6626 29.676 34.7356 29.2338 34.8089 28.7899C34.8321 28.6496 34.8552 28.5092 34.8791 28.3688C35.1218 26.9501 35.3614 25.5346 35.6009 24.1191C35.8405 22.7035 36.08 21.288 36.3227 19.8693C36.4098 19.3717 36.4938 18.8771 36.5777 18.3826C36.6618 17.8878 36.7458 17.393 36.8329 16.8951C36.8391 16.8516 36.8422 16.8049 36.8454 16.7582C36.8485 16.7116 36.8516 16.6649 36.8578 16.6213C36.8776 16.4994 36.8974 16.3776 36.9172 16.2559C37.059 15.3847 37.1996 14.5207 37.3307 13.6471C37.6542 11.5192 37.9653 9.40362 38.2765 7.28808C38.4507 6.1432 38.6 4.99832 38.6996 3.85345C38.7493 3.33078 38.7867 2.79568 38.824 2.26057C38.8613 1.72546 38.6871 1.28991 38.3013 0.941468C37.8285 0.518359 37.2311 0.481027 36.6338 0.505915C35.8996 0.543249 35.1778 0.705026 34.4809 0.966358C32.9254 1.56369 31.3823 2.16101 29.8392 2.77079C25.7326 4.41344 21.6384 6.06854 17.5691 7.77341C15.8642 8.48274 14.1718 9.19207 12.4793 9.91384C11.7742 10.2125 11.069 10.5222 10.3639 10.8319C10.0113 10.9868 9.65865 11.1417 9.30602 11.2952C8.93095 11.4614 8.55587 11.6253 8.18117 11.789C7.34997 12.1521 6.52061 12.5145 5.69717 12.9005C4.20384 13.5849 2.71052 14.2942 1.26698 15.0907C1.25407 15.0979 1.24115 15.1051 1.22821 15.1124C0.929176 15.2795 0.622508 15.451 0.395873 15.7253C0.097209 16.0738 0.097209 16.3849 0.395873 16.7333C0.582539 16.9449 0.818981 17.1191 1.06787 17.2436C3.5194 18.4631 6.0705 19.3964 8.78336 19.8071C10.1398 20.0186 11.4216 19.7573 12.6162 19.0231C13.0522 18.7488 13.4939 18.4803 13.9361 18.2115C14.6173 17.7974 15.2997 17.3826 15.9637 16.9449C16.7367 16.4385 17.5033 15.9257 18.2726 15.4112Z" fill="white"/>
          </svg>
        </div>
        <span>@bitlabacademy</span>
      </a>
      <span>
        Отсканируй QR и будь вкурсе всех самых новых событий в it мире, а также имей возможность познакомится с такими же энтузиастами как и ты)
      </span>
    </div>
  </div>
</template>

<script>
import { toDataURL } from 'qrcode';

export default {
  name: "TelegramQrTab",
  data(){
    return {
      loading: true,
      accessTokenError: false,
    }
  },

  mounted(){
    this.getAccessToken().then(() => {
      this.loading = false
    });
  },
  
  methods:{
    async getAccessToken(){
      await this.$axios.get("bot-access-token/generate").then((res) => {
        if (res && res.data && res.data.uuid){
          toDataURL(
            res.data.uuid,
            {
              type: 'image/jpeg',
              quality: 0.3,
              margin: 1,
              color: {
                dark:"#171729",
                // light:"#FFBF60FF"
              },
              width: 240,
              height: 240
            }
          ).then(url => {
            console.log(this.$refs.qrTarget);
            this.$refs.qrTarget.src = url;
          }).catch(err => {
            console.error(err)
          })
        } else {
          // Если не пришел uuid сделать двойное сальто
        }
      }).catch((err) => {
        console.log(err);
        // ошибочка, ебать...
      })

    }
  },

}
</script>
<style lang="scss">
.qr-tab{
  display: inline-flex;
  align-items: center;
  flex-wrap: wrap;
  gap: 24px;

  img {
    display: block;
  }
  .v-banner{
    margin: 0 1px
  }
  .qr-tab__link {
    border: 1px solid rgba(23, 23, 41, 0.2);
    border-radius: 20px;
    padding: 24px;
    display: inline-flex;
    align-items: center;
    text-decoration: none;
    gap: 1rem;
    color: #171729;
    font-weight: 500;
    font-size: 20px;
    margin-bottom: 1rem;
  }
  .qr-tab__telegram-icon {
    width: 72px;
    height: 72px;
    border-radius: 100%;
    background: #0088CC;
    display: flex;
    align-items: center;
    justify-content: center;
  }
}
</style>
