const JavaContent = [
  {
    title: 'Добро пожаловать на наш марафон по программированию на Java.',
    content: 'Здесь мы постараемся дать тебе четкое понимание, ' +
      'кто такой программист и напишем вместе с тобой первые алгоритмы. ' +
      'Перед тем как мы погрузимся в дивный IT мир позволь тебе рассказать о формате проведения ' +
      'нашего марафона, о правилах и о том, что тебя ждет в конце.'
  },
  {
    img: require('@/assets/png/cinfo-1.png'),
    title: 'Марафон Java - нулевой уровень',
    content: 'Сейчас ты находишься здесь, на 0 уровне. ' +
      'Здесь собираются все новички, которые хотят попробовать свои силы в программировании. ' +
      'Марафон - это полностью самостоятельная работа, так что вся ответственность за результат на тебе. ' +
      'Смотри видероуроки, читай лекции, решай задачи!'
  },
  {
    img: require('@/assets/png/cinfo-2.png'),
    title: 'Java Standard Edition - Основной курс после марафона',
    content: '<b>«Основы Java SE»</b> - это наш основной курс , на котором ты получишь крепчайший фундамент в кодинге на Java. ' +
      'Основное преимущество курса - это <b>опытные тренеры</b>, которые проводят живые уроки <b>3 раза в неделю в течение 2х месяцев.</b> ' +
      'Информация о нем будет доступна на портале:)'
  },
  {
    img: require('@/assets/png/cinfo-3.png'),
    title: 'Профи курс Java Enterprise + Spring Boot',
    content: 'После получения фундаментально важных практических навыков в программировании мы стартуем <b>продвинутый курс ' +
      '«Java Enteprise + Spring Boot»</b>, в котором ты научишься создавать мощные <b>WEB приложения</b>, такие как Aviata, HomeBank, ' +
      'Kaspi.kz  и многое другое. Курс нацелен на <b>backend разработку</b>, но мы тебя научим круто верстать сайты с использованием лучших практик <b>HTML/CSS/JS.</b> <br>' +
      '<b>На курс принимаются только выпускники курса Java SE :)</b>'
  }
]

export {
  JavaContent
}
