<template>
  <v-container>
    <h4 class="text-center">ПУБЛИЧНЫЙ ДОГОВОР-ОФЕРТА</h4>
    <h5 class="text-center mb-4">Платформа онлайн курсов BITLAB Academy</h5>
    <p>Настоящий договор является официальным предложением (публичной офертой) адресованным любому физическому лицу, в дальнейшем именуемому <strong>Заказчик</strong>, согласившемуся с условиями настоящей публичной оферты, путем ее полного и безоговорочного акцепта. <strong>Заказчик</strong> обязан полностью ознакомиться с настоящим документом до момента внесения оплаты.</p>
    <h4 class="pb-4">1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h4>
    <p>В целях настоящей оферты нижеприведенные термины используются в следующих значениях:
      <br><strong>Оферта</strong> — настоящий документ, опубликованный на сайте www.bitlab.kz
      <br><strong>Акцепт Оферты</strong> — полное и безоговорочное принятие Оферты путем осуществления действий, указанных в п. 2.8. Оферты. Акцепт Оферты создает Договор.
      <br><strong>Заказчик</strong> — совершеннолетнее лицо, осуществившее Акцепт Оферты, являющееся потребителем платных образовательных услуг по заключенному Договору, либо правомочный представитель несовершеннолетнего лица, которое будет потребителем платных образовательных услуг.
      <br><strong>Договор</strong> — договор между Заказчиком и Исполнителем на предоставление образовательных услуг, который заключается посредством Акцепта Оферты.
      <br><strong>Сайт</strong> — интернет ресурс, содержащий полную информацию о содержании и стоимости курсов, размещенный по адресу http://bitlab.kz
      <br><strong>Тариф</strong> — набор услуг, входящих в стоимость курса.
    </p>
    <h4 class="pb-4">2. ОБЩИЕ ПОЛОЖЕНИЯ</h4>
    <p>2.1. <strong>ТОО «BITLAB»</strong>, в дальнейшем именуемый <strong>Исполнитель</strong>, публикует настоящий договор купли-продажи, являющийся публичным договором - офертой (предложением) в адрес физических и юридических лиц в соответствии со ст. 447 Гражданского Кодекса Республики Казахстан (далее – ГК РК).</p>
    <p>2.2. Настоящая публичная оферта (именуемая в дальнейшем «Оферта») определяет все существенные условия договора между ТОО «BITLAB» и лицом, акцептовавшим Оферту.</p>
    <p>2.3. Настоящий договор заключается между Покупателем и Исполнителем в момент оформления заказа.</p>
    <p>2.4. Оферта может быть принята любым физическим или юридическим лицом на территории Республики Казахстан, имеющим намерение приобрести товар и/или услуги, реализуемые/предоставляемые ТОО «BITLAB»</p>
    <p>2.5. Исполнитель предоставляет, а Заказчик оплачивает информационно-консультационные услуги в рамках выбранного курса, продолжительность и план которых, определены на информационном сайте Заказчика</p>
    <p>2.6. Покупатель безоговорочно принимает все условия, содержащиеся в оферте в целом (т.е. в полном объеме и без исключений).</p>
    <p>2.7. В случае принятия условий настоящего договора (т.е. публичной оферты Исполнителя), физическое или юридическое лицо, производящее акцепт оферты, становится Покупателем.</p>
    <p>2.8. Оплатой Заказчик выражает свое полное и безоговорочное принятие условий настоящего договора (акцепт).</p>
    <p>2.9. Стоимость услуг по Договору сообщается на Сайте и составляет сумму, указанную для конкретного курса, интересующего Заказчика, в соответствии с тарифом, указанным на странице курса.</p>
    <h4 class="pb-4">3. ОБЯЗАННОСТИ И СТАТУС ИСПОЛНИТЕЛЯ</h4>
    <p>3.1. Платформа является собственностью ТОО «BITLAB» и предназначен для организации дистанционного обучения через сеть интернет. Исполнитель обязан:</p>
    <p>3.2. Организовать и обеспечить надлежащее качественное исполнение услуг, предусмотренных в п. 2.5. настоящего Договора, в соответствии с учебным планом и тарифом, выбранным Заказчиком.</p>
    <p>3.3. Для организации доступа к учебным материалам и видеоурокам Исполнитель обязуется провести регистрацию Заказчика в учётной системе Сайта, предоставить логин и пароль к Личному кабинету (профилю).</p>
    <p>3.4. Передать пробные видеоуроки Заказчику, чтобы он смог принять решение по покупке курса.</p>
    <p>3.5. Обеспечить Заказчика всеми необходимыми учебными методическими материалами.</p>
    <p>3.6. В случае отсутствия доступа к учебным материалам в связи с техническими неполадками Сайта Исполнитель обязан устранить неполадки либо предоставить альтернативный доступ к учебным материалам.</p>
    <h4 class="pb-4">4. ОБЯЗАННОСТИ И СТАТУС ЗАКАЗЧИКА</h4>
    <p>4.1. Заказчик предоставляет достоверную информацию при регистрации на Сайте и поддерживает эту информацию в актуальном состоянии в личном кабинете (профиле).</p>
    <p>4.2. Покупатель подтверждает свое согласие с условиями, установленными настоящим Договором, путем Акцепта настоящего Договора.</p>
    <p>4.3. Услуга приобретается Заказчиком исключительно для личных, семейных, домашних нужд, не связанных с осуществлением предпринимательской деятельности.</p>
    <p>4.4. Исполнитель имеет право отказать Заказчику в оказании услуг в случае предоставления Заказчиком заведомо неверной (ложной) информации.</p>
    <p>4.5. Заказчик обязан надлежащим образом выполнять задания по подготовке к занятиям.</p>
    <p>4.6. Заказчик обязан строго следовать инструкциям преподавателя при выполнении заданий.</p>
    <h4 class="pb-4">5. ПРАВА ИСПОЛНИТЕЛЯ И ЗАКАЗЧИКА</h4>
    <p>5.1. Исполнитель вправе для оказания услуг привлекать третьих лиц, отвечая за их действия.</p>
    <p>5.2. Исполнитель вправе отказать Заказчику в оказании новых услуг, если Заказчик в период обучения допускал нарушения, предусмотренные гражданским законодательством и настоящим договором, и дающие Исполнителю право в одностороннем порядке отказаться от исполнения договора.</p>
    <p>5.3. Исполнитель имеет право незамедлительно прекратить оказание образовательных услуг в случае проявления со стороны Заказчика агрессии или неуважительного отношения.</p>
    <p>5.4. Заказчик вправе обращаться к Исполнителю при возникновении вопросов по проходящему курсу, а Исполнитель обязуется в полной мере ответить на возникшие вопросы Заказчика</p>
    <h4 class="pb-4">6. ОПЛАТА УСЛУГ</h4> 
    <p>6.1. Заказчик производит оплату услуг Исполнителя до начала обучения в размере 100% предоплаты путем перечисления безналичных денежных средств Исполнителю на расчетный счет Исполнителя.</p>
    <p>6.2. Моментом оплаты считается поступление средств на расчетный счет Исполнителя.</p>
    <p>6.3 Оплата услуг производится в казахстанских тенге.</p>
    <h4 class="pb-4">7. ПРОХОЖДЕНИЕ ЗАНЯТИЙ</h4>
    <p>7.1. Заказчик, обучающийся по тарифам, включающих онлайн поддержку преподавателя, обязан выполнять все домашние задания. Сертификат прохождения курса выдается лишь при выполнении всех заданий курса.</p>
    <p>7.2. Преподавательская онлайн поддержка осуществляется в течение всего курса. При выборе пакета «Базовый» преподавательская поддержка не предусмотрена.</p>
    <p>7.3. Преподавательская онлайн поддержка включает в себя проверку домашних заданий Заказчика, ответы на возникшие вопросы во время прохождения курса.</p>
    <h4 class="pb-4">8. СРОК ДЕЙСТВИЯ ДОСТУПОВ К ОНЛАЙН ПЛАТФОРМЕ</h4>
    <p>8.1. Доступ к онлайн платформе, срок которой определен его тарифом, остается у Заказчика, только если Заказчик проходит курс полностью. Полным завершением курса считается прохождение всех экзаменов и получение электронного сертификата, согласно п.п. 13.3.</p>
    <p>8.2. Сроки доступа по тарифам:</p>
    <p>8.2.1. При выборе пакета «Базовый», по окончанию курса доступ остается открытым на 5 месяцев.</p>
    <p>8.2.2. При выборе пакета «Стандарт», по окончанию курса доступ остается открытым на 12 месяцев.</p>
    <h4 class="pb-4">9. СОБЛЮДЕНИЕ АВТОРСКОГО ПРАВА И КОНФИДЕНЦИАЛЬНОСТЬ</h4>
    <p>9.1. Заказчик обязан соблюдать авторские права <strong>ТОО «BITLAB»</strong> на все материалы курса в соответствии с Законом об авторских правах.</p>
    <p>9.2. Заказчику запрещается копировать какие-либо видео- или текстовые материалы.</p>
    <p>9.3. Заказчику запрещено использовать полученные на занятиях в <strong>ТОО «BITLAB»</strong> учебные материалы в коммерческих целях, от своего имени, размещать в открытом доступе, передавать третьим лицам.</p>
    <p>9.4. Заказчику запрещено передавать третьим лицам логин и пароль доступа на Сайт. Обнаружение факта доступа к материалам курсов третьих лиц является основанием для одностороннего расторжения Исполнителем договора без возврата денежных средств.</p>
    <p>9.5. Факт заключения настоящего Договора не рассматривается Сторонами как конфиденциальная информация</p>
    <p>9.6. Стороны обязуются не разглашать информацию, полученную Сторонами в ходе выполнения своих обязательств по настоящему Договору, за исключением случаев, когда Сторона обязана предоставить такую информацию в соответствии с действующим законодательством, применимым к Договору, или было получено согласие на разглашение такой информации.</p>
    <h4 class="pb-4">10. ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ ЗАКАЗЧИКА</h4>
    <p>10.1. При регистрации на курс Заказчик предоставляет следующую информацию: фамилия, имя, контактный номер телефона, адрес электронной почты.</p>
    <p>10.2. Информация, предоставленная Заказчиком, является конфиденциальной. Заказчик, предоставляя свои персональные данные, зарегистрировавшись на сайте или заполнении заявки дает своими действиями согласие на обработку его персональных данных в целях исполнения пользовательского соглашения. Исполнитель использует информацию о Заказчике исключительно в целях функционирования платформы (отправление уведомления Заказчика о выполнении заказа и т.д.) и в случаях, указанных в настоящем Договоре-оферте.</p>
    <p>10.3. Под обработкой персональных данных понимается любое действие (операция) или совокупность действий (операций), совершаемых Исполнителем с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение) извлечение, использование, обезличивание, блокирование, удаление, уничтожение персональных данных.</p>
    <p>10.4. Исполнитель получает информацию об ip-адресе посетителя Сайта. Данная информация не используется для установления личности посетителя.</p>
    <p>10.5. Исполнитель не несет ответственности за сведения, предоставленные Заказчиком на Сайте в общедоступной форме.</p>
    <p>10.6. Исполнитель вправе осуществлять записи телефонных разговоров с Заказчиком. При этом Исполнитель обязуется: предотвращать попытки несанкционированного доступа к информации, полученной в ходе телефонных переговоров, и/или передачу ее третьим лицам, не имеющим непосредственного отношения к исполнению Заказов.</p>
    <h4 class="pb-4">11. ОСНОВАНИЯ И УСЛОВИЯ ИЗМЕНЕНИЯ И РАСТОРЖЕНИЯ ДОГОВОРА</h4>
    <p>11.1. Условия, на которых заключен настоящий договор, могут быть изменены либо по соглашению сторон, либо в соответствии с действующим законодательством Республики Казахстан.</p>
    <p>11.2. Настоящий договор может быть расторгнут по соглашению сторон. По инициативе одной из сторон договор может быть расторгнут по основаниям, предусмотренным действующим законодательством Республики Казахстан. В случае расторжения договора до начала обучение, Исполнитель возвращает оплату за курс.</p>
    <p>11.3. Отказ от обучения или перевод на другой курс производятся по заявлению Заказчика в электронном виде на электронную почту или на контактный номер. Отказ возможен в течение 24 часов с момента оплаты курса. При отказе от обучения, денежные средства возвращаются только если слушатель не приступил к обучению.</p>
    <p>11.4. В случае отказа от обучения если слушатель уже приступил к обучению, возврат денежных средств не осуществляется.</p>
    <p>11.5. Исполнитель вправе отказаться от исполнения договора, если Заказчик нарушил п.9.3 и п.9.4 услуг по настоящему договору.</p>
    <p>11.6. Договор считается расторгнутым со дня письменного уведомления Исполнителем Заказчика об отказе от исполнения договора.</p>
    <h4 class="pb-4">12. ОТВЕТСТВЕННОСТЬ ЗА НЕИСПОЛНЕНИЕ ИЛИ НЕНАДЛЕЖАЩЕЕ ИСПОЛНЕНИЕ ОБЯЗАТЕЛЬСТВ ПО НАСТОЯЩЕМУ ДОГОВОРУ</h4>
    <p>12.1. В случае неисполнения или ненадлежащего исполнения сторонами обязательств по настоящему договору они несут ответственность, предусмотренную гражданским законодательством и законодательством о защите прав потребителей, на условиях, установленных этим законодательством.</p>
    <p>12.2. Заказчик соглашается и признаёт, что действия, совершённые с использованием аутентификационных данных (логина и пароля) в Личном кабинете, порождают юридические последствия, аналогичные использованию личных подписей.</p>
    <p>12.3. Исполнитель не гарантирует отсутствие неполадок и ошибок в работе Сайта.</p>
    <p>12.4. Ни одна из Сторон не будет нести ответственности за полное или частичное неисполнение любой из своих обязанностей по настоящему Договору, если неисполнение будет являться следствием обстоятельств непреодолимой силы. Сторона, для которой создалась невозможность исполнения обстоятельств, обязана немедленно в письменном виде уведомить другую сторону о наступлении, предполагаемом сроке действия и прекращения вышеуказанных обстоятельств. Неуведомление или несвоевременное уведомление лишает Стороны права ссылаться на любое вышеуказанное обстоятельство как на основание, освобождающее от ответственности за неисполнение обязательства.</p>
    <h4 class="pb-4">13. СРОК ДЕЙСТВИЯ ДОГОВОРА И ДРУГИЕ УСЛОВИЯ</h4>
    <p>13.1. Настоящий Договор вступает в силу с момента акцепта Заказчиком данной Публичной оферты и действует до полного исполнения Сторонами взятых на себя обязательств.</p>
    <p>13.2. Исполнитель оставляет за собой право внести изменения в настоящий Договор в любой момент по своему усмотрению, такие изменения вступают в силу с момента размещения изменённого текста Договора, если иной срок вступления изменений в силу не определён дополнительно в тексте публикации.</p>
    <p>13.3. Стороны считают обучение законченным, если Заказчику был предоставлен доступ к материалам курса, Заказчик выполнял задания и получал преподавательскую поддержку в соответствии с выбранным тарифом и получил электронный сертификат с подтверждением об окончании курса.</p>
    <h4 class="pb-4">14. АДРЕС И РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ</h4>
    <p>Исполнитель:</p>
    <p><strong>ТОО «BITLAB»</strong></p>
    <p>БИН 171040024499</p>
    <p>Республика Казахстан, город Алматы, ул. Айманова 126</p>
    <p>ИИК KZ609470398991969357</p>
    <p>в АО ДОЧЕРНЫЙ БАНК «АЛЬФА- БАНК»</p>
    <p>БИК ALFAKZKA</p>
  </v-container>
</template>

<script>
export default {
  name: 'TermsView'
}
</script>

<style>

</style>